Comment: |
    2024-06-20 - this recipe replaces the Microsoft Teams (work or school) after the product name change by Microsoft
    2026-09-30 - updated the recipe to use parent recipe from main AutoPkg repo instead of from dataJAR to avoid error "Invalid file Failed". This happens when running with CAR in cloud, likely as a result of processing in the check phase.  PlistReader then throws an error when trying to access a file in autopkg/cache/local.ws1.MicrosoftTeams2/DOWNLOAD_XML/0409TEAMS21-chk.plist
Description: Downloads, and creates a Munki package for Microsoft Teams, and imports it into WorkSpace ONE UEM.
Identifier: com.github.codeskipper.ws1.MicrosoftTeams2
ParentRecipe: MSTeams2.munki.recipe
MinimumVersion: '2.7'

Input:
  NAME: Microsoft Teams
  DISPLAY_NAME: Microsoft Teams
  MUNKI_REPO_SUBDIR: apps/Microsoft
  MUNKI_CATEGORY: Productivity
  CHANNEL: 'Production'
  LOCALE_ID: '1033' # EN-US 0x409 - see https://learn.microsoft.com/en-us/openspecs/windows_protocols/ms-lcid/a9eac961-e77d-41a6-90a5-ce1a8b0cdb9c
  # LOCALE_ID: '2057' # EN-GB 0x809 - see https://learn.microsoft.com/en-us/openspecs/windows_protocols/ms-lcid/a9eac961-e77d-41a6-90a5-ce1a8b0cdb9c
  PRODUCT: 'Teams2'
  VERSION: 'latest'


  pkginfo:
    catalogs:
    - testing
    category: Productivity
    developer: Microsoft
    description: |
      Get more done with Microsoft Teams.

      Your modern workplace at home, in the office, and on the go.
    display_name: '%DISPLAY_NAME%'
    name: '%NAME%'
    notes: |
        2024-06-20 - this recipe replaces the Microsoft Teams (work or school) after the product name change by Microsoft
    unattended_install: true
    unattended_uninstall: true

  # WS1 specific input,  secrets
  WS1_OAUTH_CLIENT_ID: OAUTH2_CLIENT_ID_HERE
  WS1_OAUTH_CLIENT_SECRET: OAUTH2_CLIENT_CLIENT_SECRET_HERE
  WS1_OAUTH_TOKEN_URL: OAUTH2_ACCESS_TOKEN_SERVER_URL_HERE
  WS1_API_USERNAME: API_USERNAME_HERE
  WS1_API_PASSWORD: API_PASSWORD_HERE
  WS1_API_TOKEN: API_TOKEN_HERE
  WS1_B64ENCODED_API_CREDENTIALS: B64ENCODED_API_CREDENTIALS_HERE
  WS1_API_URL: WORKSPACEONE_API_URL_HERE
  WS1_CONSOLE_URL: WORKSPACEONE_CONSOLE_URL_HERE
  WS1_GROUPID: GROUP_ID_HERE
  WS1_SMART_GROUP_NAME: SMART_GROUP_NAME_HERE
  WS1_PUSH_MODE: PUSH_MODE_SETTING

Process:
- Processor: com.github.codeskipper.VMWARE-WorkSpaceOneImporter/WorkSpaceOneImporter
  Arguments:
    ws1_oauth_client_id: '%WS1_OAUTH_CLIENT_ID%'
    ws1_oauth_client_secret: '%WS1_OAUTH_CLIENT_SECRET%'
    ws1_oauth_token_url: '%WS1_OAUTH_TOKEN_URL%'
    ws1_api_token: '%WS1_API_TOKEN%'
    ws1_api_username: '%WS1_API_USERNAME%'
    ws1_api_password: '%WS1_API_PASSWORD%'
    ws1_b64encoded_api_credentials: '%WS1_B64ENCODED_API_CREDENTIALS%'
    ws1_api_url: '%WS1_API_URL%'
    ws1_console_url: '%WS1_CONSOLE_URL%'
    ws1_groupid: '%WS1_GROUPID%'
    ws1_smart_group_name: '%WS1_SMART_GROUP_NAME%'
    ws1_push_mode: '%WS1_PUSH_MODE%'


