Comment:
Description: |
  Downloads and Creates a Munki package for Mac Admins Python Recommended, imports it into
  WorkSpace ONE UEM, and makes assignment rules.
Identifier: com.github.codeskipper.ws1.MacAdminsPython
ParentRecipe: com.github.codeskipper.munki.MacadminsPython
MinimumVersion: '2.3'

Input:
  NAME: MacAdmins Python Recommended
  MUNKI_REPO_SUBDIR: macadmins/python
  INCLUDE_PRERELEASES: 'False'
  pkginfo:
    name: '%NAME%'
    display_name: 'MacAdmins Python Recommended'
    category: devops
    catalogs:
      - testing
    description: |
      Framework files for use with popular Python3 Mac Admin toolsets. Relocatable, includes PyObjC.
      Python3 is not included by default in macOS since Monterey v.12.3.

      Installs to /Library/ManagedFrameworks/Python/Python3.framework - out of the way for
      developers and other power users.

      https://github.com/macadmins/python#recommended
    developer: MacAdmins
    unattended_install: True
    minimum_os_version: '10.9'

  # WS1 specific input,  secrets
  WS1_OAUTH_CLIENT_ID: OAUTH2_CLIENT_ID_HERE
  WS1_OAUTH_CLIENT_SECRET: OAUTH2_CLIENT_CLIENT_SECRET_HERE
  WS1_OAUTH_TOKEN_URL: OAUTH2_ACCESS_TOKEN_SERVER_URL_HERE
  WS1_API_USERNAME: API_USERNAME_HERE
  WS1_API_PASSWORD: API_PASSWORD_HERE
  WS1_API_TOKEN: API_TOKEN_HERE
  WS1_B64ENCODED_API_CREDENTIALS: B64ENCODED_API_CREDENTIALS_HERE
  WS1_API_URL: WORKSPACEONE_API_URL_HERE
  WS1_CONSOLE_URL: WORKSPACEONE_CONSOLE_URL_HERE
  WS1_GROUPID: GROUP_ID_HERE
  WS1_SMART_GROUP_NAME: SMART_GROUP_NAME_HERE
  WS1_PUSH_MODE: PUSH_MODE_SETTING


  # WS1 - testing new AppsV2 assignments feature
  ws1_app_assignments:
      - distribution:
          name: ASSIGNMENT_NAME
          description: ASSIGNMENT_DESCRIPTION
          smart_group_names:
            - SMART_GROUP_NAME1
            - SMART_GROUP_NAME2
          app_delivery_method: AUTO_OR_ON_DEMAND
          distr_delay_days: DISTRIBUTION_DELAY_DAYS
          display_in_app_catalog: true
          is_default_assignment: false
          keep_app_updated_automatically: true
        restriction:
            remove_on_unenroll: false
            managed_access: false
            desired_state_management: false
            prevent_removal: false

Process:
- Processor: com.github.codeskipper.VMWARE-WorkSpaceOneImporter/WorkSpaceOneImporter
  Arguments:
    ws1_oauth_client_id: '%WS1_OAUTH_CLIENT_ID%'
    ws1_oauth_client_secret: '%WS1_OAUTH_CLIENT_SECRET%'
    ws1_oauth_token_url: '%WS1_OAUTH_TOKEN_URL%'
    ws1_api_token: '%WS1_API_TOKEN%'
    ws1_api_username: '%WS1_API_USERNAME%'
    ws1_api_password: '%WS1_API_PASSWORD%'
    ws1_b64encoded_api_credentials: '%WS1_B64ENCODED_API_CREDENTIALS%'
    ws1_api_url: '%WS1_API_URL%'
    ws1_console_url: '%WS1_CONSOLE_URL%'
    ws1_groupid: '%WS1_GROUPID%'
    ws1_smart_group_name: '%WS1_SMART_GROUP_NAME%'
    ws1_push_mode: '%WS1_PUSH_MODE%'
